Updating diagrams
